var ChatDef = {
    ChatType : cc.Enum({
        Emotion: 0, //表情
        QuickChat: 1,//常用语
        WordChat: 2,//文字聊天
    }),
    quickChatMsg : [
        "天灵灵，地灵灵，太上老君快显灵！",
        "哎，输光了，洗洗睡了！",
        "哎，现在又处于下风！",
        "别看牌，我们闷到底！",
        "不要偷鸡，我的牌很大哦！",
        "不要走，决战到天亮！",
        "冲动是魔鬼，冷静!",
        "大家好，很高兴见到各位！",
        "交个朋友吧，以后一起打牌!",
        "今日运气不好，我明日再来!",
        "看我通杀全场，这些钱都是我的!",
        "快点吧，我等的花儿都谢了!",
        "你的牌打的也太好了!",
        "青山不改，绿水长流，后会有期!",
        "我就喜欢和你们反着压!",
        "这把我有信心，跟我一起下!",
        "这局我压多一点!"
    ],
}

module.exports = ChatDef;